const shva = "ְ";
const patakh = "ַ";

const yuktol = {

    formName: "yuktol",

    Ana: "אַפְעֺל",
    Inte: "תֻפְעֺל",
    Inti: "תֻפֻעְלִי",
    Huwe: "יֻפְעֺל",
    Hiye: "תֻפְעֺל",
    Ihna: "נֻפְעֺל",
    Intu: "תֻפֻעְלוּ",
    Humme: "יֻפֻעְלוּ",

    processingToForm: {
        "yuktol": [-1, -1, -1, -1, -1],
        "yimsek": [-1, -1, -1, -1, -1],
        "yisma": [-1, -1, -1, -1, -1],
        "iruh": [1, 0, 2, 1, -1, -1, -1, patakh, 0],
        "ijib": [1, 0, 2, 1, -1, -1, -1, shva, 0],
        "ihki": [1, 0, 2, 1, -1, -1, - 1, shva, 0],
        "insa": [1, 0, 2, 1, -1, -1, - 1, shva, 0],
        "ihibb": [1, 0, 2, 1, -1, -1, - 1, shva, 0],
        "ihutt": [-1, -1, -1, -1, -1],

    },

    formsToDistractWith: {
        // pronounNum : [array of possible forms],
        0: [1, 2, 3],
        1: [1, 2, 3],
        2: [1, 2, 3],
        3: [1, 2, 3],
        4: [1, 2, 3],
        5: [1, 2, 3],
        6: [1, 2, 3],
        7: [1, 2, 3],
    }
}

const yimsek = {

    formName: "yimsek",

    Ana: "אַפְעֵל",
    Inte: "תִפְעֵל",
    Inti: "תִפִעְלִי",
    Huwe: "יִפְעֵל",
    Hiye: "תִפְעֵל",
    Ihna: "נִפְעֵל",
    Intu: "תִפִעְלוּ",
    Humme: "יִפִעְלוּ",

    processingToForm: {
        "yuktol": [-1, -1, -1, -1, -1],
        "yimsek": [-1, -1, -1, -1, -1],
        "yisma": [-1, -1, -1, -1, -1],
        "iruh": [1, 0, 2, 1, -1, -1, -1, patakh, 0],
        "ijib": [-1, -1, -1, -1, -1],
        "ihki": [1, 0, 2, 1, -1, -1, - 1, shva, 0],
        "insa": [1, 0, 2, 1, -1, -1, - 1, shva, 0],
        "ihibb": [1, 0, 2, 1, -1, -1, - 1, shva, 0],
        "ihutt": [-1, -1, -1, -1, -1],

    },

    formsToDistractWith: {
        0: [0, 2, 3],
        1: [0, 2, 3],
        2: [0, 2, 3],
        3: [0, 2, 3],
        4: [0, 2, 3],
        5: [0, 2, 3],
        6: [0, 2, 3],
        7: [0, 2, 3],
    }
}

const yisma = {

    formName: "yisma",

    Ana: "אַפְעַל",
    Inte: "תִפְעַל",
    Inti: "תִפְעַלִי",
    Huwe: "יִפְעַל",
    Hiye: "תִפְעַל",
    Ihna: "נִפְעַל",
    Intu: "תִפְעַלוּ",
    Humme: "יִפְעַלוּ",

    processingToForm: {
        "yuktol": [-1, -1, -1, -1, -1],
        "yimsek": [-1, -1, -1, -1, -1],
        "yisma": [-1, -1, -1, -1, -1],
        "iruh": [1, 0, 2, 1, -1, -1, -1, patakh, 0],
        "ijib": [-1, -1, -1, -1, -1],
        "ihki": [1, 0, 2, 1, -1, -1, - 1, shva, 0],
        "insa": [1, 0, 2, 1, -1, -1, - 1, shva, 0],
        "ihibb": [1, 0, 2, 1, -1, -1, - 1, shva, 0],
        "ihutt": [-1, -1, -1, -1, -1],

    },

    formsToDistractWith: {
        0: [0, 1, 3],
        1: [0, 1, 3],
        2: [0, 1, 3],
        3: [0, 1, 3],
        4: [0, 1, 3],
        5: [0, 1, 3],
        6: [0, 1, 3],
        7: [0, 1, 3],
    }
}

const iruh = {

    formName: "iruh",

    Ana: "אַפוּל",
    Inte: "תְפוּל",
    Inti: "תְפוּלי",
    Huwe: "יְפוּל",
    Hiye: "תְפוּל",
    Ihna: "נְפוּל",
    Intu: "תְפוּלוּ",
    Humme: "יְפוּלוּ",

    processingToForm: {
        "yuktol": [-1, -1, -1, -1, -1],
        "yimsek": [-1, -1, -1, -1, -1],
        "yisma": [-1, -1, -1, -1, -1],
        "iruh": [-1, -1, -1, -1, -1],
        "ijib": [-1, -1, -1, -1, -1],
        "ihki": [-1, -1, 2, 1, -1],
        "insa": [-1, -1, 2, 1, -1],
        "ihibb": [-1, -1, 2, 1, -1],
        "ihutt": [-1, -1, 2, 1, -1],

    },

    formsToDistractWith: {
        0: [4, 6, 8],
        1: [4, 6, 8],
        2: [4, 6, 8],
        3: [4, 6, 8],
        4: [4, 6, 8],
        5: [4, 6, 8],
        6: [4, 6, 8],
        7: [4, 6, 8],
    }
}

const ijib = {
    formName: "ijib",

    Ana: "אַפִיל",
    Inte: "תְפִיל",
    Inti: "תְפִילִי",
    Huwe: "יְפִיל",
    Hiye: "תְפִיל",
    Ihna: "נְפִיל",
    Intu: "תְפִילו",
    Humme: "יְפִילוּ",

    processingToForm: {
        "yuktol": Math.random() > 0.5 ? [-1, -1, 1, 2, -1] : [-1, -1, -1, -1, -1],
        "yimsek": [-1, -1, 1, 2, -1],
        "yisma": [-1, -1, -1, -1, -1],
        "iruh": [-1, -1, -1, -1, -1],
        "ijib": [-1, -1, -1, -1, -1],
        "ihki": [-1, -1, 2, 1, -1],
        "insa": [-1, -1, 2, 1, -1],
        "ihibb": [-1, -1, 2, 1, -1],
        "ihutt": [-1, -1, 2, 1, -1],

    },
    formsToDistractWith: {
        0: [2, 6, 7],
        1: [2, 6, 7],
        2: [2, 6, 7],
        3: [2, 6, 7],
        4: [2, 6, 7],
        5: [2, 6, 7],
        6: [2, 6, 7],
        7: [2, 6, 7],
    }
}
const ihki = {
    formName: "ihki",

    Ana: "אַפְעִי",
    Inte: "תִפְעִי",
    Inti: "תִפְעִי",
    Huwe: "יִפְעִי",
    Hiye: "תִפְעִי",
    Ihna: "נִפְעִי",
    Intu: "תִפְעוּ",
    Humme: "יִפְעוּ",

    processingToForm: {
        "yuktol": [-1, -1, -1, -1, -1],
        "yimsek": [-1, -1, -1, -1, -1],
        "yisma": [-1, -1, -1, -1, -1],
        "iruh": [-1, -1, 1, 2, -1],
        "ijib": [-1, -1, 1, 2, -1],
        "ihki": [-1, -1, -1, -1, -1],
        "insa": [-1, -1, 1, 2, 2],
        "ihibb": [-1, -1, -1, -1, -1],
        "ihutt": [-1, -1, -1, -1, -1],

    },
    formsToDistractWith: {
        0: [3, 6, 7],
        1: [3, 6, 7],
        2: [3, 4, 7],
        3: [3, 6, 7],
        4: [3, 6, 7],
        5: [3, 6, 7],
        6: [3, 4, 7],
        7: [3, 4, 7],
    }
}

const insa = {

    formName: "insa",

    Ana: "אַפְעַא",
    Inte: "תִפְעַא",
    Inti: "תִפְעִי",
    Huwe: "יִפְעַא",
    Hiye: "תִפְעַא",
    Ihna: "נִפְעַא",
    Intu: "תִפְעוּ",
    Humme: "יִפְעוּ",

    processingToForm: {
        "yuktol": [-1, -1, -1, -1, -1],
        "yimsek": [-1, -1, -1, -1, -1],
        "yisma": [-1, -1, -1, -1, -1],
        "iruh": [-1, -1, 1, 2, -1],
        "ijib": [-1, -1, 1, 2, -1],
        "ihki": [-1, -1, -1, -1, -1],
        "insa": [-1, -1, -1, -1, -1],
        "ihibb": [-1, -1, -1, -1, -1],
        "ihutt": [-1, -1, -1, -1, -1],
    },

    formsToDistractWith: {
        0: [1, 3, 8],
        1: [1, 3, 8],
        2: [1, 2, 8],
        3: [1, 3, 8],
        4: [1, 3, 8],
        5: [1, 3, 8],
        6: [1, 2, 8],
        7: [1, 2, 8],
    }
}
const ihibb = {
    formName: "ihibb",

    Ana: "אַפִעّ",
    Inte: "תְפִעّ",
    Inti: "תְפִעִّי",
    Huwe: "יְפִעّ",
    Hiye: "תְפִעّ",
    Ihna: "נְפִעّ",
    Intu: "תְפִעّוּ",
    Humme: "יְפִעّוּ",

    processingToForm: {
        "yuktol": [-1, -1, 0, 2, 2],
        "yimsek": [-1, -1, 0, 2, 2],
        "yisma": [-1, -1, 0, 2, 2],
        "iruh": [-1, -1, 1, 2, -1],
        "ijib": [-1, -1, 1, 2, 2],
        "ihki": [-1, -1, -1, -1, 1],
        "insa": [-1, -1, -1, -1, 1],
        "ihibb": [-1, -1, -1, -1, -1],
        "ihutt": [-1, -1, -1, -1, -1],
    },
    formsToDistractWith: {
        0: [4, 6, 8],
        1: [4, 6, 8],
        2: [4, 6, 8],
        3: [4, 6, 8],
        4: [4, 6, 8],
        5: [4, 6, 8],
        6: [4, 6, 8],
        7: [4, 6, 8],
    }
}

const ihutt = {
    formName: "ihutt",

    Ana: "אַפֻעّ",
    Inte: "תְפֻעّ",
    Inti: "תְפֻעִّי",
    Huwe: "יְפֻעّ",
    Hiye: "תְפֻעّ",
    Ihna: "נְפֻעّ",
    Intu: "תְפֻעّוּ",
    Humme: "יְפֻעّוּ",

    processingToForm: {
        "yuktol": [-1, -1, 0, 2, 2],
        "yimsek": [-1, -1, 0, 2, 2],
        "yisma": [-1, -1, 0, 2, 2],
        "iruh": [-1, -1, 1, 2, 2],
        "ijib": [-1, -1, 1, 2, 2],
        "ihki": [-1, -1, -1, -1, 1],
        "insa": [-1, -1, -1, -1, 1],
        "ihibb": [-1, -1, -1, -1, -1],
        "ihutt": [-1, -1, -1, -1, -1],
    },
    formsToDistractWith: {
        0: [3, 6, 7],
        1: [3, 6, 7],
        2: [3, 6, 7],
        3: [3, 6, 7],
        4: [3, 6, 7],
        5: [3, 6, 7],
        6: [3, 6, 7],
        7: [3, 6, 7],
    }
}


export const formsFuture = {
    "yuktol": yuktol,
    "yimsek": yimsek,
    "yisma": yisma,
    "iruh": iruh,
    "ijib": ijib,
    "ihki": ihki,
    "insa": insa,
    "ihibb": ihibb,
    "ihutt": ihutt
}