const shva = "ְ";

const katab = {

    formName: "katab",

    Ana: "פַעַלְת",
    Inte: "פַעַלְת",
    Inti: "פַעַלְתִי",
    Huwe: "פַעַל",
    Hiye: "פַעְלַת",
    Ihna: "פַעַלְנַא",
    Intu: "פַעַלְתוּ",
    Humme: "פַעַלוּ",

    processingToForm: {
        "katab": [-1, -1, -1, -1, -1],
        "nizel": [-1, -1, -1, -1, -1],
        "haka": [1, 0, 2, 1, -1, -1, -1, shva, 0],
        "nisi": [-1, -1, -1, -1, -1],
        "habb": [1, 0, 2, 1, -1, -1, - 1, shva, 0],
        "rah": [1, 0, 2, 1, -1, -1, - 1, shva, 0],
        "jab": [1, 0, 2, 1, -1, -1, - 1, shva, 0],
    },

    // pronouns : array of possible forms
    formsToDistractWith: {
        0: [1, 2, 4, 5],
        1: [1, 2, 4, 5],
        2: [1, 2, 4, 5],
        3: [1, 2, 3, 4],
        4: [1, 2, 4, 5],
        5: [1, 2, 4, 5],
        6: [1, 2, 4, 5],
        7: [1, 2, 4, 5],
    }
}

const nizel = {

    formName: "nizel",

    Ana: "פְעִלְת",
    Inte: "פְעִלְת",
    Inti: "פְעִלְתִי",
    Huwe: "פִעֵל",
    Hiye: "פִעְלַת",
    Ihna: "פְעִלְנַא",
    Intu: "פְעִלְתוּ",
    Humme: "פִעְלוּ",


    processingToForm: {
        "katab": [-1, -1, -1, -1, -1],
        "nizel": [-1, -1, -1, -1, -1],
        "haka": [1, 0, 2, 1, -1, -1, -1, shva, 0],
        "nisi": [-1, -1, -1, -1, -1],
        "habb": [1, 0, 2, 1, -1, -1, - 1, shva, 0],
        "rah": [1, 0, 2, 1, -1, -1, - 1, shva, 0],
        "jab": [1, 0, 2, 1, -1, -1, - 1, shva, 0],

    },

    formsToDistractWith: {
        0: [0, 2, 4, 5],
        1: [0, 2, 4, 5],
        2: [0, 2, 4, 5],
        3: [0, 2, 3, 4],
        4: [0, 2, 4, 5],
        5: [0, 2, 4, 5],
        6: [0, 2, 4, 5],
        7: [0, 2, 4, 5],
    }
}
const haka = {

    formName: "haka",

    Ana: "פַעֵית",
    Inte: "פַעֵית",
    Inti: "פַעֵיתִי",
    Huwe: "פַעַא",
    Hiye: "פַעַת",
    Ihna: "פַעֵינַא",
    Intu: "פַעֵיתוּ",
    Humme: "פַעוּ",

    processingToForm: {
        "katab": Math.random() > 0.5 ? [-1, -1, 1, 2, -1] : [-1, -1, -1, -1, -1],
        "nizel": [-1, -1, 1, 2, -1],
        "haka": [-1, -1, -1, -1, -1],
        "nisi": [-1, -1, -1, -1, -1, 2, "י"],
        "habb": [-1, -1, -1, -1, -1],
        "rah": [-1, -1, 1, 2, -1],
        "jab": [-1, -1, 1, 2, -1],

    },

    formsToDistractWith: {
        0: [3, 4, 5, 6],
        1: [3, 4, 5, 6],
        2: [3, 4, 5, 6],
        3: [3, 4, 5],
        4: [3, 4, 5],
        5: [3, 4, 5, 6],
        6: [3, 4, 5, 6],
        7: [0, 3, 4],
    }
}
const nisi = {
    formName: "nisi",

    Ana: "פְעִית",
    Inte: "פְעִית",
    Inti: "פְעִיתִי",
    Huwe: "פִעִי",
    Hiye: "פִעְיַת",
    Ihna: "פְעִינַא",
    Intu: "פְעִיתוּ",
    Humme: "פִעְיוּ",

    processingToForm: {
        "katab": Math.random() > 0.5 ? [-1, -1, 1, 2, -1] : [-1, -1, -1, -1, -1],
        "nizel": [-1, -1, 1, 2, -1],
        "haka": [-1, -1, -1, -1, -1],
        "nisi": [-1, -1, -1, -1, -1, 2, "י"],
        "habb": [-1, -1, -1, -1, -1],
        "rah": [-1, -1, 1, 2, -1],
        "jab": [-1, -1, 1, 2, -1],
    },

    formsToDistractWith: {
        0: [2, 4, 5, 6],
        1: [2, 4, 5, 6],
        2: [2, 4, 5, 6],
        3: [2, 4, 5],
        4: [2, 4, 5],
        5: [2, 4, 5, 6],
        6: [2, 4, 5, 6],
        7: [0, 2, 4, 5],
    }
}
const habb = {
    formName: "habb",

    Ana: "פַעֵّית",
    Inte: "פַעֵّית",
    Inti: "פַעֵّיתִי",
    Huwe: "פַעّ",
    Hiye: "פַעַّת",
    Ihna: "פַעֵّינַא",
    Intu: "פַעֵّיתוּ",
    Humme: "פַעّוּ",

    processingToForm: {
        "katab": [-1, -1, 1, 2, 2],
        "nizel": [-1, -1, 1, 2, 2],
        "haka": [-1, -1, -1, -1, 1],
        "nisi": [-1, -1, -1, -1, 1, 2, "י"],
        "habb": [-1, -1, -1, -1, -1],
        "rah": [-1, -1, 1, 2, 2],
        "jab": [-1, -1, 1, 2, 2],
    },

    formsToDistractWith: {
        0: [2, 3, 5, 6],
        1: [2, 3, 5, 6],
        2: [2, 3, 5, 6],
        3: [2, 3, 5],
        4: [2, 3, 5],
        5: [2, 3, 5, 6],
        6: [2, 3, 5, 6],
        7: [2, 3, 5],
    }
}
const rah = {

    formName: "rah",

    Ana: "פֻלְת",
    Inte: "פֻלְת",
    Inti: "פֻלְתִי",
    Huwe: "פַאל",
    Hiye: "פַאלַת",
    Ihna: "פֻלְנַא",
    Intu: "פֻלְתוּ",
    Humme: "פַאלוּ",

    processingToForm: {
        "katab": Math.random() > 0.2 ? [-1, -1, -1, -1, -1] : [-1, -1, 2, 1, -1],
        "nizel": Math.random() > 0.2 ? [-1, -1, -1, -1, -1] : [-1, -1, 2, 1, -1],
        "haka": [-1, -1, 2, 1, 1],
        "nisi": [-1, -1, 2, 1, -1, 2, "י"],
        "habb": [-1, -1, 2, 1, -1],
        "rah": [-1, -1, -1, -1, -1],
        "jab": [-1, -1, -1, -1, -1],
    },

    formsToDistractWith: {
        0: [2, 3, 4, 6],
        1: [2, 3, 4, 6],
        2: [2, 3, 4, 6],
        3: [2, 3, 4],
        4: [2, 3, 4],
        5: [2, 3, 4, 6],
        6: [2, 3, 4, 6],
        7: [2, 3, 4],
    }
}
const jab = {
    formName: "jab",

    Ana: "פִלְת",
    Inte: "פִלְת",
    Inti: "פִלְתִי",
    Huwe: "פַאל",
    Hiye: "פַאלַת",
    Ihna: "פִלְנַא",
    Intu: "פִלְתוּ",
    Humme: "פַאלוּ",

    processingToForm: {
        "katab": Math.random() > 0.2 ? [-1, -1, -1, -1, -1] : [-1, -1, 2, 1, -1],
        "nizel": Math.random() > 0.2 ? [-1, -1, -1, -1, -1] : [-1, -1, 2, 1, -1],
        "haka": [-1, -1, 2, 1, 1],
        "nisi": [-1, -1, 2, 1, -1, 2, "י"],
        "habb": [-1, -1, 2, 1, -1],
        "rah": [-1, -1, -1, -1, -1],
        "jab": [-1, -1, -1, -1, -1],
    },

    formsToDistractWith: {
        0: [2, 3, 4, 5],
        1: [2, 3, 4, 5],
        2: [2, 3, 4, 5],
        3: [2, 3, 4],
        4: [0, 3, 4],
        5: [2, 3, 4, 5],
        6: [2, 3, 4, 5],
        7: [2, 3, 4],
    }
}

export const formsPast = {
    "katab": katab,
    "nizel": nizel,
    "haka": haka,
    "nisi": nisi,
    "habb": habb,
    "rah": rah,
    "jab": jab
}